package com.cxp.jokes.model;

import java.util.List;

/**
 * Created by cxp on 17-1-13.
 */

public class TxtJokesModel {

    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"allPages":993,"ret_code":0,"contentlist":[{},{"id":"5878909a6e36803402a4d31a","text":"<p>\r\n\t\t1、一天，我和男友大吵一架，闹得很凶 ，谁也不让谁，我一气之下，用手挠了他胳膊上好几个血道子；<p><\/p>\r\n他也急眼了，抓起我的手狠狠的按在桌子上；<p><\/p>\r\n我害怕了，只见他抄起一把指甲刀给我把指甲剪了。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、在一次辩论中，瓦特激动的说：\u201c我观察了很长时间，发现在盆底加热会使水沸腾而沸腾的水会产生水蒸气。这个水蒸气的力量非常的大！甚至可以推动上面的\u2026\u2026\u201d<p><\/p>\r\n\u201c我没问你这个！ \u201d法官打断了瓦特，\u201c我是问，你当时真没发现你爸在澡盆里吗？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、搞对象不是看对方会为你做什么，而是看对方会为你而改变什么<p><\/p>......","title":"冷幽默:冰力十足,绝对的冷","type":1,"ct":"2017-01-13 16:32:26.285"},{"id":"5878909a6e36803402a4d319","text":"<p>\r\n\t\t1、今天吴老二终于睡到自然醒，他伸了伸懒腰，看了看旁边的女人，微笑着说：\u201c嗨！我还不知道你叫什么。\u201d<p><\/p>\r\n\u201c我也不知道你叫什么，不过我知道你这科肯定挂了。\u201d监考老师说完收走了他的白卷。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、以前成绩很好，但不爱交作业，初中时候班里英语课代表一美女，但是我很讨厌她，因为她天天催我交作业。<p><\/p>\r\n后来高中了，又一个班，她还是英语课代表，又这样催我交作业催了三年。<p><\/p>\r\n如今，她躺在我身边，还是每天催我回家交作业\u2026\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、早上上班见我桌子上放着两瓶营养快线，遂好奇问旁边妹子什么意思，妹子答曰：送你个二奶。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、我们初中班主任是个极品<p><\/p>......","title":"爆冷内涵的校园段子","type":1,"ct":"2017-01-13 16:32:26.285"},{"id":"5878909a6e36803402a4d317","text":"<p>\r\n\t\t1、小明狠狠的说道：\u201c对方辩友，你倒是说话啊，无言以对了吧！ \u201d<p><\/p>\r\n主持人：\u201c把手松开！你想憋死他呀！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、小明坐在家门口吃雪糕，不远处站着一个衣衫褴褛的小男孩正眼巴巴的瞅着他，垂涎欲滴的样子。<p><\/p>\r\n小明觉得他很可怜，就招手让小男孩过来。<p><\/p>\r\n然后递给他一个板凳说：\u201c来，坐着看！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、夜深人静，窗帘发牢骚：\u201c我天天风吹日晒的，被子哥，你好幸福，天天搂着女主人睡觉。\u201d<p><\/p>\r\n被子：\u201c幸福？你知道一个屁多久才会散吗？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、随着手术灯的熄灭，产房里传来一阵哭喊：老公！对不起！！！<p><\/p>......","title":"开心冷料,笑果冻人","type":1,"ct":"2017-01-13 16:32:26.283"},{"id":"5878909a6e36803402a4d316","text":"<p>\r\n\t\t1、青年见禅师：女友总是跟我闹分手，希望大师指点。\u201d<p><\/p>\r\n禅师笑而不语，抓来一只鸡，在鸡腿上缠根线，他一拉线，鸡立即跌倒，鸡挣扎起来继续走，禅师又一拉，鸡又跌倒，如此反复八次之多。<p><\/p>\r\n青年若有所悟：\u201c大师您是让我欲擒故纵，放长线钓大鱼？\u201d<p><\/p>\r\n禅师一笑：\u201c小伙子，我是让你拉j8倒吧。 \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、话说鲁智深到了大相国寺，仍是戒不掉那酒瘾，<p><\/p>\r\n常常醉后惹事，闹得寺里鸡犬不宁。<p><\/p>\r\n众僧告到方丈处，方丈无奈，私下里劝鲁智深：你喝酒我不管，但求酒后莫要失态！<p><\/p>......","title":"恶搞有方,搞笑才有奇效","type":1,"ct":"2017-01-13 16:32:26.283"},{"id":"5878909a6e36803402a4d315","text":"<p>\r\n\t\t1、\u201c各位游客，这个山洞就是当年唐僧师徒取经路上休息过的地方。\u201d<p><\/p>\r\n\u201c导游你真能忽悠！ \u201d<p><\/p>\r\n\u201c真不忽悠，这里面的确有猴粪、猪粪、马粪，还有人类的排泄物。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、今天，哥在路上闲逛，不小心撞到电线杆，突然眼前一片漆黑。<p><\/p>\r\n当天亮时，发现旁边的人都装着古装。<p><\/p>\r\n哥明白哥穿越了，正纳闷这是哪个朝代，突然有东西砸到我的头。<p><\/p>\r\n正想大骂，抬头一看，原来是一个美女在撑开窗户。<p><\/p>\r\n那杆不小心掉下来了。于是哥明白了，回去立马派出杀手杀了武松。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、有个人问禅师：\u201c世人骂我、辱我、笑我、轻我、贱我、恶我、如何处置乎？\u201d<p><\/p>......","title":"冷人的忽悠、穿越和二货禅师","type":1,"ct":"2017-01-13 16:32:26.282"},{"id":"5878909a6e36803402a4d312","text":"<p>\r\n\t\t1、乘客A：这趟公交车可真暖和。<p><\/p>\r\n乘客B：是啊，尤其是外面那么冷，刚上车好像钻被窝了一样。<p><\/p>\r\n乘客A：别扯了，你家被窝里有这么多人啊？\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、医生：你这两颗坏牙可以拔掉了。<p><\/p>\r\n患者：我害怕啊，牙拔掉了会不会有啥副作用啊？<p><\/p>\r\n医生：副作用应该没啥，不过你的体重可能会轻一些。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、有时候我很想离家出走，可我想，我要是失踪了，我的父母应该会心急如焚，<p><\/p>......","title":"幽默的人就是会逗人开心","type":1,"ct":"2017-01-13 16:32:26.226"},{"id":"5878909a6e36803402a4d311","text":"<p>\r\n\t\t1、看到一个无线路由器评价，笑死我了：\u201c想给无线路由器的厂家提点意见：以后的产品还是不要用三根天线为好，你们有没有想过，三根天线就像三根香，中国人比较忌讳。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、公车上一老叔级别的大声接电话：几百万的活太小了，目前这行情，十几个亿利润也不大，要不这次多弄点库存，五百亿行不，返点多给你点。<p><\/p>\r\n一车人那个藐视埃<p><\/p>\r\n一少妇看不上去了，说：大哥，你今天没坐专机去办公埃<p><\/p>\r\n老叔挂了电话好像知道了点啥，连忙解释说：我是印冥币的。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、刚才在公交车上，忽然听到身后咔咔摇微信的声音。<p><\/p>......","title":"冷到恐怖,冷死人不偿命","type":1,"ct":"2017-01-13 16:32:26.226"},{"id":"5878890d6e36803402a4aa16","text":"<p>\r\n\t\t1、A：\u201c我觉得我们几个也该发散一下思维，创造个吉尼斯记录什么的。\u201d<p><\/p>\r\nB：\u201c好提议\u201d<p><\/p>\r\nA：\u201c我砍一棵树，两头削尖，申请世界上最大的牙签记录。\u201d<p><\/p>\r\nB：\u201c你讲点实用的行不行。\u201d<p><\/p>\r\nA：\u201c我在地上挖个坑，灌点水，申请世界上最小的湖。\u201d<p><\/p>\r\nB：\u201c那我干脆在地上刨三个洞，三个手指伸出去，申请世界上最大的保龄球。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、有这么一天，豆腐在大街上闲逛，遇见了醋，豆腐就调侃的说：\u201c好大的酸味啊，又去挑拨人家的感情了？\u201d<p><\/p>\r\n醋一生气就把豆腐给拌了！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、关羽右臂中毒箭，华佗为其刮骨疗伤，手术进行中，关羽突然吃吃笑了起来。<p><\/p>......","title":"经典有趣,爆冷逗人","type":1,"ct":"2017-01-13 16:00:13.966"},{"id":"5878890d6e36803402a4aa15","text":"<p>\r\n\t\t1、儿子：爸爸，我不想写作业。<p><\/p>\r\n爸爸：我给你讲个故事。美国和前苏联进行空间竞赛，双方都遇到了一个问题，如何在无重力条件下写字。<p><\/p>\r\n于是美国人花大价钱研制了无重力圆珠笔，前苏联人就用了铅笔。<p><\/p>\r\n这说明，你就是跑到太空也得把作业做完！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、小时候爸爸常年在外出差，偶尔回来。 映像中冬天我睡得特别早，迷迷糊糊就被妈妈抱到她床上去了。<p><\/p>\r\n可是早上醒来我又在自己床上，到最后我才明白过来。&nbsp;<p><\/p>\r\n原来我那亲爱的老妈总是让我去给她暖被窝\u2026\u2026这亲娘！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、吵架之后，妻子扬言要带儿子回娘家。可小孩磨磨蹭蹭就是不愿意，妻子大怒，一撒腿自己就跑了。<p><\/p>......","title":"爆冷:被黑了的孩子真可怜啊","type":1,"ct":"2017-01-13 16:00:13.957"},{"id":"5878890d6e36803402a4aa11","text":"<p>\r\n\t\t1、多去高档大剧院捡点先锋话剧、歌剧、交响乐、芭蕾舞的演出票根，然后塞到自己的挎包里，在人多聚会的场合里在包里取东西时\u201c恰到好处\u201d地散落几张。<p><\/p>\r\n被人发现后，你就有机会卖弄一下从网上查来的观后感~~\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、越是公共场合越要乱中求静地捧本厚书看，一定要是外文书，什么公车了，地铁了，星巴克了，必胜客了，总之要书不离手！<p><\/p>\r\n切忌看啥阿疯、挨拍！用电子产品装B是一时的，升级换代忒快，纸质书籍才是永恒的装B杀器。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、《装B句式小技巧》使用通感：我听到风是香的，我看见雨是甜的。<p><\/p>......","title":"有奇效的装B小技巧","type":1,"ct":"2017-01-13 16:00:13.137"},{"id":"58787b016e36803402a4773e","text":"熊家庭条件特好，超有钱，夏天去北极避暑，就叫北极熊。到马来西亚旅游，就叫马来熊。海滩上太阳毒，晒成棕熊。又到非洲住三年把自己整成黑熊。跟风取个英文名叫泰迪熊。狗嫁它，生下狗熊，猫嫁它，后代是熊猫。最后，家产花光，变成倒霉熊。","title":"动物的幽默\u201c变迁\u201d","type":1,"ct":"2017-01-13 15:00:17.138"},{"id":"58787aff6e36803402a4773a","text":"灰太狼在家边做家务，边唱了起来：\u201c狼爱上羊呀，爱得疯狂\u201d。话音刚落，平顶锅就落脑袋上了。。。","title":"动物王国的开心冷人事儿","type":1,"ct":"2017-01-13 15:00:15.725"},{"id":"58787aff6e36803402a47739","text":"螃蟹：走自己的路，让别人说去吧。<p><\/p>3、乌鸦：言多必失。<p><\/p>4、蚯蚓：世界上本来没有路，钻营的久了也就有了路。<p><\/p>5、蛇：道路是曲折的。<p><\/p>6、蛾：前途是光明的。<p><\/p>7、啄木鸟：虽然靠嘴吃饭，从来没有说过一句空话。<p><\/p>8、猫头鹰：虽然夜间出没，从不做偷鸡摸狗的事。<p><\/p>9、蜘蛛：1.天网恢恢，疏而不漏。2.有虫自远方来，不亦乐乎。3.我丝故我在。<p><\/p>10、蚕：世界上没有两片相同的桑叶。<p><\/p>11、鹬：精诚所至，金石为开。<p><\/p>1","title":"动物嘴里的的名言雷语","type":1,"ct":"2017-01-13 15:00:15.725"},{"id":"58787aff6e36803402a47738","text":"牛：身上真痒痒得难受，好久没人来吹牛皮了。","title":"动物的俏皮功夫了不得。","type":1,"ct":"2017-01-13 15:00:15.678"},{"id":"587827106e36803402a2ab72","title":"朋友气愤地对他老婆说","text":"朋友气愤地对他老婆说：你竟然用我的钱养别的男人！\r\n朋友老婆一脸懵逼问：我养谁了？\r\n朋友答：马云！\r\n今天我回家就跟老婆说：你竟然用我的钱养别的男人！\r\n老婆弱弱地看着我说：没有，我和他出去都是他掏钱！","type":1,"ct":"2017-01-13 09:02:08.209"},{"id":"587769606e3649a1661b5f61","title":"很多本来觉得丑的东西","text":"很多本来觉得丑的东西一旦知道是贵的就觉得好像也不那么丑了。如果再发现是名牌，我会马上怀疑自己的审美出了问题。并开始进行自我反省。然后发自内心觉得好看。。。","type":1,"ct":"2017-01-12 19:32:48.427"},{"id":"587761c06e3649a1661b395f","title":"朋友圈好友发了条：用","text":"朋友圈好友发了条：用眼过度，酸累肿胀，好难受！大家纷纷留言多休息闭目养神之类，竟然有个二货问\u201c哪个眼？\u201d","type":1,"ct":"2017-01-12 19:00:16.573"},{"id":"587761c06e3649a1661b395e","title":"人这辈子，要么忍，要","text":"人这辈子，要么忍，要么残忍。所以，每次出现家暴时，我选了前者，老婆选了后者。","type":1,"ct":"2017-01-12 19:00:16.573"},{"id":"58774dbd6e3649a1661b0ad1","title":"比起穷这个弱点来，丑","text":"比起穷这个弱点来，丑简直不值一提。","type":1,"ct":"2017-01-12 17:34:53.158"}],"currentPage":1,"allNum":19845,"maxResult":20}
     */

    private ShowapiResBodyBean showapi_res_body;

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        /**
         * allPages : 993
         * ret_code : 0
         * contentlist : [{},{"id":"5878909a6e36803402a4d31a","text":"<p>\r\n\t\t1、一天，我和男友大吵一架，闹得很凶 ，谁也不让谁，我一气之下，用手挠了他胳膊上好几个血道子；<p><\/p>\r\n他也急眼了，抓起我的手狠狠的按在桌子上；<p><\/p>\r\n我害怕了，只见他抄起一把指甲刀给我把指甲剪了。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、在一次辩论中，瓦特激动的说：\u201c我观察了很长时间，发现在盆底加热会使水沸腾而沸腾的水会产生水蒸气。这个水蒸气的力量非常的大！甚至可以推动上面的\u2026\u2026\u201d<p><\/p>\r\n\u201c我没问你这个！ \u201d法官打断了瓦特，\u201c我是问，你当时真没发现你爸在澡盆里吗？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、搞对象不是看对方会为你做什么，而是看对方会为你而改变什么<p><\/p>......","title":"冷幽默:冰力十足,绝对的冷","type":1,"ct":"2017-01-13 16:32:26.285"},{"id":"5878909a6e36803402a4d319","text":"<p>\r\n\t\t1、今天吴老二终于睡到自然醒，他伸了伸懒腰，看了看旁边的女人，微笑着说：\u201c嗨！我还不知道你叫什么。\u201d<p><\/p>\r\n\u201c我也不知道你叫什么，不过我知道你这科肯定挂了。\u201d监考老师说完收走了他的白卷。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、以前成绩很好，但不爱交作业，初中时候班里英语课代表一美女，但是我很讨厌她，因为她天天催我交作业。<p><\/p>\r\n后来高中了，又一个班，她还是英语课代表，又这样催我交作业催了三年。<p><\/p>\r\n如今，她躺在我身边，还是每天催我回家交作业\u2026\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、早上上班见我桌子上放着两瓶营养快线，遂好奇问旁边妹子什么意思，妹子答曰：送你个二奶。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、我们初中班主任是个极品<p><\/p>......","title":"爆冷内涵的校园段子","type":1,"ct":"2017-01-13 16:32:26.285"},{"id":"5878909a6e36803402a4d317","text":"<p>\r\n\t\t1、小明狠狠的说道：\u201c对方辩友，你倒是说话啊，无言以对了吧！ \u201d<p><\/p>\r\n主持人：\u201c把手松开！你想憋死他呀！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、小明坐在家门口吃雪糕，不远处站着一个衣衫褴褛的小男孩正眼巴巴的瞅着他，垂涎欲滴的样子。<p><\/p>\r\n小明觉得他很可怜，就招手让小男孩过来。<p><\/p>\r\n然后递给他一个板凳说：\u201c来，坐着看！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、夜深人静，窗帘发牢骚：\u201c我天天风吹日晒的，被子哥，你好幸福，天天搂着女主人睡觉。\u201d<p><\/p>\r\n被子：\u201c幸福？你知道一个屁多久才会散吗？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、随着手术灯的熄灭，产房里传来一阵哭喊：老公！对不起！！！<p><\/p>......","title":"开心冷料,笑果冻人","type":1,"ct":"2017-01-13 16:32:26.283"},{"id":"5878909a6e36803402a4d316","text":"<p>\r\n\t\t1、青年见禅师：女友总是跟我闹分手，希望大师指点。\u201d<p><\/p>\r\n禅师笑而不语，抓来一只鸡，在鸡腿上缠根线，他一拉线，鸡立即跌倒，鸡挣扎起来继续走，禅师又一拉，鸡又跌倒，如此反复八次之多。<p><\/p>\r\n青年若有所悟：\u201c大师您是让我欲擒故纵，放长线钓大鱼？\u201d<p><\/p>\r\n禅师一笑：\u201c小伙子，我是让你拉j8倒吧。 \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、话说鲁智深到了大相国寺，仍是戒不掉那酒瘾，<p><\/p>\r\n常常醉后惹事，闹得寺里鸡犬不宁。<p><\/p>\r\n众僧告到方丈处，方丈无奈，私下里劝鲁智深：你喝酒我不管，但求酒后莫要失态！<p><\/p>......","title":"恶搞有方,搞笑才有奇效","type":1,"ct":"2017-01-13 16:32:26.283"},{"id":"5878909a6e36803402a4d315","text":"<p>\r\n\t\t1、\u201c各位游客，这个山洞就是当年唐僧师徒取经路上休息过的地方。\u201d<p><\/p>\r\n\u201c导游你真能忽悠！ \u201d<p><\/p>\r\n\u201c真不忽悠，这里面的确有猴粪、猪粪、马粪，还有人类的排泄物。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、今天，哥在路上闲逛，不小心撞到电线杆，突然眼前一片漆黑。<p><\/p>\r\n当天亮时，发现旁边的人都装着古装。<p><\/p>\r\n哥明白哥穿越了，正纳闷这是哪个朝代，突然有东西砸到我的头。<p><\/p>\r\n正想大骂，抬头一看，原来是一个美女在撑开窗户。<p><\/p>\r\n那杆不小心掉下来了。于是哥明白了，回去立马派出杀手杀了武松。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、有个人问禅师：\u201c世人骂我、辱我、笑我、轻我、贱我、恶我、如何处置乎？\u201d<p><\/p>......","title":"冷人的忽悠、穿越和二货禅师","type":1,"ct":"2017-01-13 16:32:26.282"},{"id":"5878909a6e36803402a4d312","text":"<p>\r\n\t\t1、乘客A：这趟公交车可真暖和。<p><\/p>\r\n乘客B：是啊，尤其是外面那么冷，刚上车好像钻被窝了一样。<p><\/p>\r\n乘客A：别扯了，你家被窝里有这么多人啊？\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、医生：你这两颗坏牙可以拔掉了。<p><\/p>\r\n患者：我害怕啊，牙拔掉了会不会有啥副作用啊？<p><\/p>\r\n医生：副作用应该没啥，不过你的体重可能会轻一些。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、有时候我很想离家出走，可我想，我要是失踪了，我的父母应该会心急如焚，<p><\/p>......","title":"幽默的人就是会逗人开心","type":1,"ct":"2017-01-13 16:32:26.226"},{"id":"5878909a6e36803402a4d311","text":"<p>\r\n\t\t1、看到一个无线路由器评价，笑死我了：\u201c想给无线路由器的厂家提点意见：以后的产品还是不要用三根天线为好，你们有没有想过，三根天线就像三根香，中国人比较忌讳。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、公车上一老叔级别的大声接电话：几百万的活太小了，目前这行情，十几个亿利润也不大，要不这次多弄点库存，五百亿行不，返点多给你点。<p><\/p>\r\n一车人那个藐视埃<p><\/p>\r\n一少妇看不上去了，说：大哥，你今天没坐专机去办公埃<p><\/p>\r\n老叔挂了电话好像知道了点啥，连忙解释说：我是印冥币的。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、刚才在公交车上，忽然听到身后咔咔摇微信的声音。<p><\/p>......","title":"冷到恐怖,冷死人不偿命","type":1,"ct":"2017-01-13 16:32:26.226"},{"id":"5878890d6e36803402a4aa16","text":"<p>\r\n\t\t1、A：\u201c我觉得我们几个也该发散一下思维，创造个吉尼斯记录什么的。\u201d<p><\/p>\r\nB：\u201c好提议\u201d<p><\/p>\r\nA：\u201c我砍一棵树，两头削尖，申请世界上最大的牙签记录。\u201d<p><\/p>\r\nB：\u201c你讲点实用的行不行。\u201d<p><\/p>\r\nA：\u201c我在地上挖个坑，灌点水，申请世界上最小的湖。\u201d<p><\/p>\r\nB：\u201c那我干脆在地上刨三个洞，三个手指伸出去，申请世界上最大的保龄球。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、有这么一天，豆腐在大街上闲逛，遇见了醋，豆腐就调侃的说：\u201c好大的酸味啊，又去挑拨人家的感情了？\u201d<p><\/p>\r\n醋一生气就把豆腐给拌了！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、关羽右臂中毒箭，华佗为其刮骨疗伤，手术进行中，关羽突然吃吃笑了起来。<p><\/p>......","title":"经典有趣,爆冷逗人","type":1,"ct":"2017-01-13 16:00:13.966"},{"id":"5878890d6e36803402a4aa15","text":"<p>\r\n\t\t1、儿子：爸爸，我不想写作业。<p><\/p>\r\n爸爸：我给你讲个故事。美国和前苏联进行空间竞赛，双方都遇到了一个问题，如何在无重力条件下写字。<p><\/p>\r\n于是美国人花大价钱研制了无重力圆珠笔，前苏联人就用了铅笔。<p><\/p>\r\n这说明，你就是跑到太空也得把作业做完！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、小时候爸爸常年在外出差，偶尔回来。 映像中冬天我睡得特别早，迷迷糊糊就被妈妈抱到她床上去了。<p><\/p>\r\n可是早上醒来我又在自己床上，到最后我才明白过来。&nbsp;<p><\/p>\r\n原来我那亲爱的老妈总是让我去给她暖被窝\u2026\u2026这亲娘！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、吵架之后，妻子扬言要带儿子回娘家。可小孩磨磨蹭蹭就是不愿意，妻子大怒，一撒腿自己就跑了。<p><\/p>......","title":"爆冷:被黑了的孩子真可怜啊","type":1,"ct":"2017-01-13 16:00:13.957"},{"id":"5878890d6e36803402a4aa11","text":"<p>\r\n\t\t1、多去高档大剧院捡点先锋话剧、歌剧、交响乐、芭蕾舞的演出票根，然后塞到自己的挎包里，在人多聚会的场合里在包里取东西时\u201c恰到好处\u201d地散落几张。<p><\/p>\r\n被人发现后，你就有机会卖弄一下从网上查来的观后感~~\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、越是公共场合越要乱中求静地捧本厚书看，一定要是外文书，什么公车了，地铁了，星巴克了，必胜客了，总之要书不离手！<p><\/p>\r\n切忌看啥阿疯、挨拍！用电子产品装B是一时的，升级换代忒快，纸质书籍才是永恒的装B杀器。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、《装B句式小技巧》使用通感：我听到风是香的，我看见雨是甜的。<p><\/p>......","title":"有奇效的装B小技巧","type":1,"ct":"2017-01-13 16:00:13.137"},{"id":"58787b016e36803402a4773e","text":"熊家庭条件特好，超有钱，夏天去北极避暑，就叫北极熊。到马来西亚旅游，就叫马来熊。海滩上太阳毒，晒成棕熊。又到非洲住三年把自己整成黑熊。跟风取个英文名叫泰迪熊。狗嫁它，生下狗熊，猫嫁它，后代是熊猫。最后，家产花光，变成倒霉熊。","title":"动物的幽默\u201c变迁\u201d","type":1,"ct":"2017-01-13 15:00:17.138"},{"id":"58787aff6e36803402a4773a","text":"灰太狼在家边做家务，边唱了起来：\u201c狼爱上羊呀，爱得疯狂\u201d。话音刚落，平顶锅就落脑袋上了。。。","title":"动物王国的开心冷人事儿","type":1,"ct":"2017-01-13 15:00:15.725"},{"id":"58787aff6e36803402a47739","text":"螃蟹：走自己的路，让别人说去吧。<p><\/p>3、乌鸦：言多必失。<p><\/p>4、蚯蚓：世界上本来没有路，钻营的久了也就有了路。<p><\/p>5、蛇：道路是曲折的。<p><\/p>6、蛾：前途是光明的。<p><\/p>7、啄木鸟：虽然靠嘴吃饭，从来没有说过一句空话。<p><\/p>8、猫头鹰：虽然夜间出没，从不做偷鸡摸狗的事。<p><\/p>9、蜘蛛：1.天网恢恢，疏而不漏。2.有虫自远方来，不亦乐乎。3.我丝故我在。<p><\/p>10、蚕：世界上没有两片相同的桑叶。<p><\/p>11、鹬：精诚所至，金石为开。<p><\/p>1","title":"动物嘴里的的名言雷语","type":1,"ct":"2017-01-13 15:00:15.725"},{"id":"58787aff6e36803402a47738","text":"牛：身上真痒痒得难受，好久没人来吹牛皮了。","title":"动物的俏皮功夫了不得。","type":1,"ct":"2017-01-13 15:00:15.678"},{"id":"587827106e36803402a2ab72","title":"朋友气愤地对他老婆说","text":"朋友气愤地对他老婆说：你竟然用我的钱养别的男人！\r\n朋友老婆一脸懵逼问：我养谁了？\r\n朋友答：马云！\r\n今天我回家就跟老婆说：你竟然用我的钱养别的男人！\r\n老婆弱弱地看着我说：没有，我和他出去都是他掏钱！","type":1,"ct":"2017-01-13 09:02:08.209"},{"id":"587769606e3649a1661b5f61","title":"很多本来觉得丑的东西","text":"很多本来觉得丑的东西一旦知道是贵的就觉得好像也不那么丑了。如果再发现是名牌，我会马上怀疑自己的审美出了问题。并开始进行自我反省。然后发自内心觉得好看。。。","type":1,"ct":"2017-01-12 19:32:48.427"},{"id":"587761c06e3649a1661b395f","title":"朋友圈好友发了条：用","text":"朋友圈好友发了条：用眼过度，酸累肿胀，好难受！大家纷纷留言多休息闭目养神之类，竟然有个二货问\u201c哪个眼？\u201d","type":1,"ct":"2017-01-12 19:00:16.573"},{"id":"587761c06e3649a1661b395e","title":"人这辈子，要么忍，要","text":"人这辈子，要么忍，要么残忍。所以，每次出现家暴时，我选了前者，老婆选了后者。","type":1,"ct":"2017-01-12 19:00:16.573"},{"id":"58774dbd6e3649a1661b0ad1","title":"比起穷这个弱点来，丑","text":"比起穷这个弱点来，丑简直不值一提。","type":1,"ct":"2017-01-12 17:34:53.158"}]
         * currentPage : 1
         * allNum : 19845
         * maxResult : 20
         */

        private int allPages;
        private int currentPage;
        private int allNum;
        private int maxResult;
        private List<ContentlistBean> contentlist;

        public int getAllPages() {
            return allPages;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getAllNum() {
            return allNum;
        }

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public List<ContentlistBean> getContentlist() {
            return contentlist;
        }

        public void setContentlist(List<ContentlistBean> contentlist) {
            this.contentlist = contentlist;
        }

        public static class ContentlistBean {
            /**
             * id : 5878909a6e36803402a4d31a
             * text : <p>
             1、一天，我和男友大吵一架，闹得很凶 ，谁也不让谁，我一气之下，用手挠了他胳膊上好几个血道子；<p></p>
             他也急眼了，抓起我的手狠狠的按在桌子上；<p></p>
             我害怕了，只见他抄起一把指甲刀给我把指甲剪了。。。
             </p>
             <p>
             2、在一次辩论中，瓦特激动的说：“我观察了很长时间，发现在盆底加热会使水沸腾而沸腾的水会产生水蒸气。这个水蒸气的力量非常的大！甚至可以推动上面的……”<p></p>
             “我没问你这个！ ”法官打断了瓦特，“我是问，你当时真没发现你爸在澡盆里吗？”
             </p>
             <p>
             3、搞对象不是看对方会为你做什么，而是看对方会为你而改变什么<p></p>......
             * title : 冷幽默:冰力十足,绝对的冷
             * type : 1
             * ct : 2017-01-13 16:32:26.285
             */

            private String id;
            private String text;
            private String title;
            private String ct;

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public String getCt() {
                return ct;
            }

            public void setCt(String ct) {
                this.ct = ct;
            }
        }
    }
}

